[
    {
        "name": "Login & Registration System (C++)",
        "url": "https://github.com/professorx2001/Login-Registration",
        "desc": "User authentication system with sign-up, login, and password recovery functionalities, with a clear CLI. Ensured username uniqueness by checking against a master list and stored passwords in individual files for security."
    },
    {
        "name": "VidTube ( MEN Stack )",
        "url": "https://github.com/professorx2001/Youtube-Backend-Clone",
        "desc": "A Backend system replicating core YouTube functionalities, developed with Node.js, Express.js, and MongoDB. It includes features like user authentication, video management, commenting, and subscriptions, providing a solid foundation for a video-sharing platform."
    },
    {
        "name": "Currency Converter ( React )",
        "url": "https://github.com/professorx2001/React-Currency-Converter",
        "desc": "A React web application that enables users to perform currency conversions using an API. With a simple and user-friendly interface, this app allows users to select the currencies they want to convert from and to, specify the amount, and instantly get the converted result. This app provides real-time exchange rate data for over 150+ currencies."
    },
    {
        "name": "Shortify-URL ( MEN Stack )",
        "url": "https://github.com/professorx2001/Shortify-URL-Shortener",
        "desc": "A URL shortening service developed using Node.js, Express.js, and MongoDB. It enables users to convert long URLs into concise, shareable links, facilitating efficient link management and redirection."
    },
    {
        "name": "Leads Tracker ( Chrome Extension )",
        "url": "https://github.com/professorx2001/LeadTracker-ChromeExtension",
        "desc": "Save web links of your leads, so you can easily find and connect with them later. Used Chrome API to capture active tab URLs seamlessly in one click and used local storage for persistent data."
    },
    {
        "name": "Smart Gate ( IOT )",
        "url": "https://github.com/professorx2001/SmartGate",
        "desc": "Arduino-based automatic gate opener system designed to provide convenience and security for gate access. It aims to simplify gate access for various applications."
    },
    {
        "name": "Tic Tac Toe Game ( C++ )",
        "url": "https://github.com/professorx2001/SKYBUG/blob/main/Tic-Tac-Toe.cpp",
        "desc": "A console-based Tic Tac Toe game in C++ with interactive user input, reset functionality, and support for multiple rounds. Implemented features like username uniqueness, player sign-up, random symbol assignment, and alternating turns."
    },
    {
        "name": "Random Password Generator ( React )",
        "url": "https://github.com/professorx2001/React-Random-Password-Generator",
        "desc": "A simple tool designed to create secure and unique passwords for improved online safety. It generates passwords using a combination of uppercase and lowercase letters, numbers, and special characters based on user-defined preferences like length, character and number types."
    },
    {
        "name": "Random Password Generator ( JS )",
        "url": "https://randompasswordx.netlify.app/",
        "desc": "A simple tool designed to create secure and unique passwords for improved online safety. It generates passwords using a combination of uppercase and lowercase letters, numbers, and special characters based on user-defined preferences like length and character types."
    },
    {
        "name": "To Do List ( React )",
        "url": "https://github.com/professorx2001/ToDo-React",
        "desc": "A simple and interactive to-do list application built with React. It allows users to add, edit, delete, and mark tasks as completed while saving data in local storage for persistence. The app features a clean and intuitive user interface for efficient task management."
    },
    {
        "name": "To Do List ( JS )",
        "url": "https://todolistplanx.netlify.app",
        "desc": "A simple application that helps users manage tasks efficiently. It allows users to add new tasks, delete completed or unwanted tasks, and ensures data persistence by storing the tasks locally on the user's device."
    },
    {
        "name": "Bento Portfolio ( TailwindCSS )",
        "url": "https://mdzakihussain.netlify.app",
        "desc": "A simple Bento Grid Inspired Portfolio Website. It is a responsive website built using Tailwind CSS, showcasing projects, skills, and contact information in a clean and organized layout."
    },
    {
        "name": "Weather App ( JS )",
        "url": "https://github.com/professorx2001/Weather-App",
        "desc": "A weather application that provides real-time weather information based on user input. It fetches data from the OpenWeatherMap API and displays details like temperature and weather conditions for the specified location."
    },
    {
        "name": "Personal Expense Tracker ( C++ )",
        "url": "https://github.com/professorx2001/Personal-Expense-Tracker",
        "desc": "A expense Tracker is a C++ application designed to help users monitor and manage their finances by tracking balances across different accounts."
    }
]
